Title: T1003 - DCSync

Tactic: Credential Access

Data Source: Logs of Domain Controller

KQL Query:

// DCSync Detection
// Reference: https://attack.mitre.org/techniques/T1003/
let timeframe = 3d;
SecurityEvent
| where TimeGenerated >= ago(timeframe)
| where EventID == 4662 and AccountType == "User"
| where Properties has "{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}"
    or Properties has "{19195a5b-6da0-11d0-afd3-00c04fd930c9}"
| project TimeGenerated, Account, Activity, Properties, SubjectLogonId, Com-puter
| join (
   SecurityEvent
   | where EventID == 4624 and LogonType == 3
   | where Activity == "4624 - An account was successfully logged on."
   | project EventID, LogonType, Activity, TargetLogonId
   | project-rename SubjectLogonId = TargetLogonId
) on SubjectLogonId
| project TimeGenerated, Account, Computer, Activity, Properties, LogonType
| sort by TimeGenerated desc
