Title: Access has been blocked due to conditional access policies

Description:
This KQL query looks to see if a user has been denied access due to the conditional access policies.

Data Source: SigninLogs

Tactic: Initial Access

KQL Query:

let starttime = 14d;
let endtime = 0d;
SigninLogs
| where TimeGenerated between(ago(starttime)..ago(endtime))
| where OperationName == "Sign-in activity" 
and ResultDescription =~ "Access has been blocked due to conditional access policies." and ResultType == "53003"
| extend City = tostring(LocationDetails.city) 
| extend State = tostring(LocationDetails.state)
| project TimeGenerated, OperationName, ResultDescription, Identity, Location, City, State, IPAddress, AppDisplayName, ClientAppUsed
| sort by TimeGenerated desc

NOTE:
This KQL query will look to see if this activity has showed up somewhere between the last 14 days. You can change this if you want.
