Title: Suspicious WMIC Activity

KQL Query:

// T1047 - Suspicious WMI Activity
// Reference: https://attack.mitre.org/techniques/T1047/  
DeviceProcessEvents  
| where Timestamp > ago(7d)
| where FolderPath contains "C:\\Windows\\System32\\wbem"
| where ProcessCommandLine has "process call create"
    or ProcessCommandLine has "path antivirusproduct"
    or ProcessCommandLine has "ntdomain"
    or ProcessCommandLine has "group"
    or ProcessCommandLine has "sysaccount"
    or ProcessCommandLine has "useraccount"
    or ProcessCommandLine has "/node:"
    or ProcessCommandLine contains "http"
    or ProcessCommandLine has "CommandLineEventConsumer"
    or ProcessCommandLine has "__EventFilter"
    or ProcessCommandLine has "__FilterToConsumerBinding"
    or ProcessCommandLine has "ActiveScriptEventConsumer"
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, DeviceId, ReportId
| sort by Timestamp desc
