title: Suspicious process executed via WMI
author: @DebugPrivilege
creation_date: 05/20/2020
platform: Windows
permissions_required:
  - Administrator
  - SYSTEM
ATT&CK:
  T1084 - Windows Management Instrumentation

Hypothesis: An adversary can use WMI to interact with local and remote systems and use it as a means to perform many tactic functions, 
such as gathering information for Discovery and remote Execution of files as part of Lateral Movement. 
Description: -| None

Detection:
  alert_title: Suspicious execution attempt via WMI
  severity: Medium
  category: Execution
  technique: T1084 - Windows Management Instrumentation
  
KQL Query:

// Suspicious process executed via WMI
// Twitter: @DebugPrivilege
let timeframe = 7d;
DeviceEvents
| where Timestamp >= ago(timeframe)
| where ActionType == "ProcessCreatedUsingWmiQuery"
| project Timestamp, DeviceId, DeviceName, RemoteDeviceName, AccountDomain, AccountName, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessFolderPath, ProcessCommandLine, ReportId
| sort by Timestamp desc
