Title: T1036.003 - Masquerading: Rename System Utilities 

Tactic: Defense Evasion

Description:
Adversaries may rename legitimate system utilities to try to evade security mechanisms concerning the usage of those utilities. 
Security monitoring and control mechanisms may be in place for system utilities adversaries are capable of abusing

KQL Query:

// T1036.003 - Masquerading: Rename System Utilities 
// Reference: https://attack.mitre.org/beta/techniques/T1036/003/
let timeframe = 14d;
DeviceFileEvents
| where Timestamp >= ago(timeframe)
| where ActionType == "FileRenamed" and FolderPath contains "C:\\Windows\\System32\\"
| where InitiatingProcessTokenElevation == "TokenElevationTypeFull"
| project Timestamp, DeviceName, ActionType, FileName, FolderPath, InitiatingProcessFolderPath, InitiatingProcessCreationTime, InitiatingProcessCommandLine, 
RequestAccountName, RequestAccountDomain
| order by Timestamp desc

