Title: T1036.003 - Masquerading: Rename System Utilities 

Tactic: Defense Evasion

Description:
Adversaries may rename legitimate system utilities to try to evade security mechanisms concerning the usage of those utilities. 
Security monitoring and control mechanisms may be in place for system utilities adversaries are capable of abusing

NOTE: This KQL query excluses .dll and other extensions, because of the noise that it might generate through print drivers.
This means that it will ONLY look for .exe extensions. It's not perfect, but I'm working on it to improve it.
Which means that this KQL query might be updated soon!

KQL Query:

// T1036.003 - Masquerading: Rename System Utilities 
// Reference: https://attack.mitre.org/beta/techniques/T1036/003/
let timeframe = 14d;
DeviceFileEvents
| where Timestamp >= ago(timeframe)
| where ActionType == "FileRenamed" and FolderPath has "C:\\Windows\\System32\\"
| where InitiatingProcessTokenElevation == "TokenElevationTypeFull"
| project Timestamp, DeviceName, ActionType, FileName, FolderPath, InitiatingProcessFolderPath, InitiatingProcessCreationTime, InitiatingProcessCommandLine, DeviceId, ReportId 
RequestAccountName, RequestAccountDomain
| where (FolderPath endswith "exe")
| order by Timestamp desc

