Title: BITS Jobs

Description: BitsAdmin is a built-in Windows tool that can used to download arbitary files on the internet.

Table: DeviceProcessEvents

KQL Query:

// T1197 - BITS Jobs
// Reference: https://attack.mitre.org/techniques/T1197/
DeviceProcessEvents
| where Timestamp >= ago(7d)
| where FolderPath == "C:\\Windows\\System32\\bitsadmin.exe" and ProcessCommandLine contains "http"
| project Timestamp, DeviceName, FolderPath, ProcessCommandLine, AccountDomain, AccountName, InitiatingProcessFolderPath, ProcessCreationTime
| sort by Timestamp desc


