Title: Use of living-off-the-land binary to hide files and directories
Author: @DebugPrivilege
Creation_date: 05/19/2020
Platform: Windows
ATT&CK:
  Technique: T1158
  
Hypothesis: Adversaries can use this to their advantage to hide files and folders anywhere on the system for persistence
Description: |- Attrib.exe is a Windows component that allows you to display or change File Attributes. 
The function of the attrib command is to set, change or remove such file attributes Using the attrib command, 
you can make files read-only, archive, system and hidden.

Detection:
  Alert_rule: Use off living-off-the-land binary to hide files and directories
  Severity: Low
  Category: Defense Evasion
  MITRE Technique: T1158 - Hidden Files and Directories
  
KQL Query:

// T1158 - Hidden Files and Directories
// Reference: https://attack.mitre.org/techniques/T1158/
// Twitter: @DebugPrivilege
let timeframe = 7d;
DeviceProcessEvents
| where Timestamp >= ago(timeframe)
| where FileName == "attrib.exe"
| where ProcessCommandLine has "+h"
    or ProcessCommandLine has "+s"
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, DeviceId, ReportId
| sort by Timestamp desc
