Title: Approve PIM activation request

Description:
This KQL query looks to see which user has approved a PIM request, but especially for the Global Administrator role.

Data Source: AuditLogs

Tactic: Privilege Escalation

KQL Query:

let timeframe = 3d;
AuditLogs
| where TimeGenerated >= ago(timeframe)
| where OperationName == "Add member to role completed (PIM activation)"
| extend TargetResources has "Global Administrator"
| extend AADOperationType has "ActivateRole"
| project TimeGenerated, Identity, TargetResources, LoggedByService, OperationName, ResultDescription, AdditionalDetails  
| join kind= inner (
   AuditLogs
   | where OperationName == "Add member to role request approved (PIM activation)"
   | extend TargetResources has "Global Administrator"
   | extend AADOperationType has "ApproveRoleActivation"
   | project TimeGenerated, Identity, TargetResources, LoggedByService, OperationName, ResultDescription, AdditionalDetails  
) on LoggedByService
| extend DirectoryRole = tostring(TargetResources[0].displayName)
| extend ExpirationTime = tostring(AdditionalDetails[3].value)
| project-rename IniatedBy = Identity1
| project TimeGenerated, IniatedBy, Identity, DirectoryRole, ExpirationTime, LoggedByService, ResultDescription 

NOTE: The timeframe is set on 3 days, so it will look in this activity appeared in the last 3 days. Feel free to change this.
